aformusatii/atmega128-dev-board/trunk/ATMEGA128_DEV_BOARD/src/RF24.cpp
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>
 Portions Copyright (C) 2011 Greg Copeland


 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */

#include "nRF24L01.h"
#include "RF24.h"

HardwarePlatform HP;

/****************************************************************************/

uint8_t RF24::read_register(uint8_t reg, uint8_t* buf, uint8_t len)
{
  uint8_t status;

  HP.csn(LOW);
  status = HP.spiTransfer( R_REGISTER | ( REGISTER_MASK & reg ) );
  while ( len-- )
    *buf++ = HP.spiTransfer(0xff);

  HP.csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t RF24::read_register(uint8_t reg)
{
  HP.csn(LOW);
  HP.spiTransfer( R_REGISTER | ( REGISTER_MASK & reg ) );
  uint8_t result = HP.spiTransfer(0xff);

  HP.csn(HIGH);
  return result;
}

/****************************************************************************/

uint8_t RF24::write_register(uint8_t reg, const uint8_t* buf, uint8_t len)
{
  uint8_t status;

  HP.csn(LOW);
  status = HP.spiTransfer( W_REGISTER | ( REGISTER_MASK & reg ) );
  while ( len-- )
    HP.spiTransfer(*buf++);

  HP.csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t RF24::write_register(uint8_t reg, uint8_t value)
{
  uint8_t status;

  IF_SERIAL_DEBUG(printf_P(PSTR("write_register(%02x,%02x)\r\n"),reg,value));

  HP.csn(LOW);
  status = HP.spiTransfer( W_REGISTER | ( REGISTER_MASK & reg ) );
  HP.spiTransfer(value);
  HP.csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t RF24::write_payload(const void* buf, uint8_t len, const uint8_t writeType)
{
  uint8_t status;

  const uint8_t* current = reinterpret_cast<const uint8_t*>(buf);

  uint8_t data_len = MIN(len,payload_size);
  uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;

  //printf_P(PSTR("[Writing %u bytes %u blanks]\r\n"),data_len,blank_len);

  HP.csn(LOW);
  status = HP.spiTransfer( writeType );
  while ( data_len-- )
    HP.spiTransfer(*current++);
  while ( blank_len-- )
    HP.spiTransfer(0);
  HP.csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t RF24::read_payload(void* buf, uint8_t len)
{
  uint8_t status;
  uint8_t* current = reinterpret_cast<uint8_t*>(buf);

  uint8_t data_len = MIN(len,payload_size);
  uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;
  
  //printf_P(PSTR("[Reading %u bytes %u blanks]\r\n"),data_len,blank_len);
  
  HP.csn(LOW);
  status = HP.spiTransfer( R_RX_PAYLOAD );
  while ( data_len-- )
    *current++ = HP.spiTransfer(0xff);
  while ( blank_len-- )
    HP.spiTransfer(0xff);
  HP.csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t RF24::flush_rx(void)
{
  uint8_t status;

  HP.csn(LOW);
  status = HP.spiTransfer( FLUSH_RX );
  HP.csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t RF24::flush_tx(void)
{
  uint8_t status;

  HP.csn(LOW);
  status = HP.spiTransfer( FLUSH_TX );
  HP.csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t RF24::get_status(void)
{
  uint8_t status;

  HP.csn(LOW);
  status = HP.spiTransfer( NOP );
  HP.csn(HIGH);

  return status;
}

/****************************************************************************/

void RF24::print_status(uint8_t status)
{
  printf_P(PSTR("STATUS\t\t = 0x%02x RX_DR=%x TX_DS=%x MAX_RT=%x RX_P_NO=%x TX_FULL=%x\r\n"),
           status,
           (status & _BV(RX_DR))?1:0,
           (status & _BV(TX_DS))?1:0,
           (status & _BV(MAX_RT))?1:0,
           ((status >> RX_P_NO) & B111),
           (status & _BV(TX_FULL))?1:0
          );
}

/****************************************************************************/

void RF24::print_observe_tx(uint8_t value)
{
  printf_P(PSTR("OBSERVE_TX=%02x: POLS_CNT=%x ARC_CNT=%x\r\n"),
           value,
           (value >> PLOS_CNT) & B1111,
           (value >> ARC_CNT) & B1111
          );
}

/****************************************************************************/

void RF24::print_byte_register(const char* name, uint8_t reg, uint8_t qty)
{
  char extra_tab = strlen_P(name) < 8 ? '\t' : 0;
  printf_P(PSTR(PRIPSTR"\t%c ="),name,extra_tab);
  while (qty--)
    printf_P(PSTR(" 0x%02x"),read_register(reg++));
  printf_P(PSTR("\r\n"));
}

/****************************************************************************/

void RF24::print_address_register(const char* name, uint8_t reg, uint8_t qty)
{
  char extra_tab = strlen_P(name) < 8 ? '\t' : 0;
  printf_P(PSTR(PRIPSTR"\t%c ="),name,extra_tab);

  while (qty--)
  {
    uint8_t buffer[5];
    read_register(reg++,buffer,sizeof buffer);

    printf_P(PSTR(" 0x"));
    uint8_t* bufptr = buffer + sizeof buffer;
    while( --bufptr >= buffer )
      printf_P(PSTR("%02x"),*bufptr);
  }

  printf_P(PSTR("\r\n"));
}

/****************************************************************************/

RF24::RF24():
  wide_band(true),
  p_variant(false),
  payload_size(32),
  ack_payload_available(false),
  dynamic_payloads_enabled(false),
  pipe0_reading_address(0),
  ack_payload_length(0)
{
}

/****************************************************************************/

void RF24::setChannel(uint8_t channel)
{
  // TODO: This method could take advantage of the 'wide_band' calculation
  // done in setChannel() to require certain channel spacing.

  const uint8_t max_channel = 127;
  write_register(RF_CH,MIN(channel,max_channel));

}

/****************************************************************************/

uint8_t RF24::getChannel( void )
{
  return read_register( RF_CH );
}

